DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
#define MC_CGM_AC4_SC_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x03A0UL))
/**************************** MC_ME Memory Map ******************************/

#define MC_ME_GS_R                         ((uint32)(MC_ME_BASEADDR+(uint32)0x0000UL))
#define MC_ME_MCTL_R                       ((uint32)(MC_ME_BASEADDR+(uint32)0x0004UL))
#define MC_ME_ME_R                         ((uint32)(MC_ME_BASEADDR+(uint32)0x0008UL))
#define MC_ME_IS_R                         ((uint32)(MC_ME_BASEADDR+(uint32)0x000CUL))
#define MC_ME_IM_R                         ((uint32)(MC_ME_BASEADDR+(uint32)0x0010UL))
#define MC_ME_IMTS_R                       ((uint32)(MC_ME_BASEADDR+(uint32)0x0014UL))

#define MC_ME_RESET_MC_R                   ((uint32)(MC_ME_BASEADDR+(uint32)0x0020UL))
#define MC_ME_TEST_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0024UL))
#define MC_ME_SAFE_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0028UL))
#define MC_ME_DRUN_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x002CUL))
#define MC_ME_RUN0_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0030UL))
#define MC_ME_RUN1_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0034UL))
#define MC_ME_RUN2_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0038UL))
#define MC_ME_RUN3_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x003CUL))
#define MC_ME_HALT_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0040UL))
#define MC_ME_STOP_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0048UL))
#define MC_ME_STBY_MC_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0054UL))

#define MC_ME_PS0_R                        ((uint32)(MC_ME_BASEADDR+(uint32)0x0060UL))
#define MC_ME_PS1_R                        ((uint32)(MC_ME_BASEADDR+(uint32)0x0064UL))
#define MC_ME_PS2_R                        ((uint32)(MC_ME_BASEADDR+(uint32)0x0068UL))
#define MC_ME_PS3_R                        ((uint32)(MC_ME_BASEADDR+(uint32)0x006CUL))

#define MC_ME_RUN_PC0_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0080UL))
#define MC_ME_RUN_PC1_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0084UL))
#define MC_ME_RUN_PC2_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0088UL))
#define MC_ME_RUN_PC3_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x008CUL))
#define MC_ME_RUN_PC4_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0090UL))
#define MC_ME_RUN_PC5_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0094UL))
#define MC_ME_RUN_PC6_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0098UL))
#define MC_ME_RUN_PC7_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x009CUL))

#define MC_ME_LP_PC0_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00A0UL))
#define MC_ME_LP_PC1_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00A4UL))
#define MC_ME_LP_PC2_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00A8UL))
#define MC_ME_LP_PC3_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00ACUL))
#define MC_ME_LP_PC4_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00B0UL))
#define MC_ME_LP_PC5_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00B4UL))
#define MC_ME_LP_PC6_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00B8UL))
#define MC_ME_LP_PC7_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00BCUL))

#define MC_ME_PCTL4_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C4UL))
#define MC_ME_PCTL5_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C5UL))
#define MC_ME_PCTL6_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C6UL))
#define MC_ME_PCTL7_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C7UL))
#define MC_ME_PCTL8_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C8UL))
#define MC_ME_PCTL9_R                      ((uint32)(MC_ME_BASEADDR+(uint32)0x00C9UL))
#define MC_ME_PCTL10_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00CAUL))
#define MC_ME_PCTL11_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00CBUL))
#define MC_ME_PCTL12_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00CCUL))
#define MC_ME_PCTL13_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00CDUL))
#define MC_ME_PCTL16_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D0UL))
#define MC_ME_PCTL17_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D1UL))
#define MC_ME_PCTL18_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D2UL))
#define MC_ME_PCTL19_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D3UL))
#define MC_ME_PCTL20_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D4UL))
#define MC_ME_PCTL21_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D5UL))
#define MC_ME_PCTL23_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D7UL))
#define MC_ME_PCTL24_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00D8UL))
#define MC_ME_PCTL26_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00DAUL))
#define MC_ME_PCTL31_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00DFUL))
#define MC_ME_PCTL32_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E0UL))
#define MC_ME_PCTL33_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E1UL))
#define MC_ME_PCTL34_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E2UL))
#define MC_ME_PCTL35_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E3UL))
#define MC_ME_PCTL36_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E4UL))
#define MC_ME_PCTL37_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E5UL))
#define MC_ME_PCTL38_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E6UL))
#define MC_ME_PCTL39_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E7UL))
#define MC_ME_PCTL40_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E8UL))
#define MC_ME_PCTL41_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00E9UL))
#define MC_ME_PCTL42_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00EAUL))
#define MC_ME_PCTL43_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00EBUL))
#define MC_ME_PCTL44_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00ECUL))
#define MC_ME_PCTL45_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00EDUL))
#define MC_ME_PCTL46_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00EEUL))
#define MC_ME_PCTL47_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00EFUL))
#define MC_ME_PCTL48_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F0UL))
#define MC_ME_PCTL49_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F1UL))
#define MC_ME_PCTL50_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F2UL))
#define MC_ME_PCTL51_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F3UL))
#define MC_ME_PCTL52_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F4UL))
#define MC_ME_PCTL53_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F5UL))
#define MC_ME_PCTL54_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F6UL))
#define MC_ME_PCTL55_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F7UL))
#define MC_ME_PCTL56_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F8UL))
#define MC_ME_PCTL57_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00F9UL))
#define MC_ME_PCTL58_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FAUL))
#define MC_ME_PCTL59_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FBUL))
#define MC_ME_PCTL60_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FCUL))
#define MC_ME_PCTL61_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FDUL))
#define MC_ME_PCTL62_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FEUL))
#define MC_ME_PCTL63_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x00FFUL))
#define MC_ME_PCTL64_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0100UL))
#define MC_ME_PCTL65_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0101UL))
#define MC_ME_PCTL66_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0102UL))
#define MC_ME_PCTL67_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0103UL))
#define MC_ME_PCTL68_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0104UL))
#define MC_ME_PCTL69_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0105UL))
#define MC_ME_PCTL70_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0106UL))
#define MC_ME_PCTL72_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0108UL))
#define MC_ME_PCTL73_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0109UL))
#define MC_ME_PCTL76_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x010CUL))
#define MC_ME_PCTL86_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0116UL))
#define MC_ME_PCTL87_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0117UL))
#define MC_ME_PCTL88_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0118UL))
#define MC_ME_PCTL89_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0119UL))
#define MC_ME_PCTL90_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x011AUL))
#define MC_ME_PCTL91_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x011BUL))
#define MC_ME_PCTL92_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x011CUL))
#define MC_ME_PCTL96_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0120UL))
#define MC_ME_PCTL98_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0122UL))
#define MC_ME_PCTL99_R                     ((uint32)(MC_ME_BASEADDR+(uint32)0x0123UL))
#define MC_ME_PCTL100_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0124UL))
#define MC_ME_PCTL101_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0125UL))
#define MC_ME_PCTL104_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x0128UL))
#define MC_ME_PCTL112_R                       (MC_ME_BASEADDR+(uint32)0x0130UL)
#define MC_ME_PCTL116_R                      (MC_ME_BASEADDR+(uint32)0x0134UL)
#define MC_ME_PCTL117_R                       (MC_ME_BASEADDR+(uint32)0x0135UL)
#define MC_ME_PCTL119_R                       (MC_ME_BASEADDR+(uint32)0x0137UL)
#define MC_ME_PCTL120_R                      (MC_ME_BASEADDR+(uint32)0x0138UL)
#define MC_ME_PCTL125_R                       (MC_ME_BASEADDR+(uint32)0x013DUL)
#define MC_ME_PCTL127_R                    ((uint32)(MC_ME_BASEADDR+(uint32)0x013FUL))

