DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
/**************************** MC_RGM Memory Map ******************************/

#define MC_RGM_FES_R                        ((uint32)(MC_RGM_BASEADDR+(uint32)0x0000UL))
#define MC_RGM_DES_R                        ((uint32)(MC_RGM_BASEADDR+(uint32)0x0002UL))
#define MC_RGM_FERD_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x0004UL))
#define MC_RGM_DERD_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x0006UL))
#define MC_RGM_FEAR_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x0010UL))
#define MC_RGM_DEAR_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x0012UL))
#define MC_RGM_FESS_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x0018UL))
#define MC_RGM_STDBY_R                      ((uint32)(MC_RGM_BASEADDR+(uint32)0x001AUL))
#define MC_RGM_FBRE_R                       ((uint32)(MC_RGM_BASEADDR+(uint32)0x001CUL))

/**************************** MC_PCU Memory Map ******************************/

#define MC_PCU_PCONF0_R                     ((uint32)(MC_PCU_BASEADDR+(uint32)0x0000UL))
#define MC_PCU_PCONF1_R                     ((uint32)(MC_PCU_BASEADDR+(uint32)0x0004UL))
#define MC_PCU_PCONF2_R                     ((uint32)(MC_PCU_BASEADDR+(uint32)0x0008UL))
#define MC_PCU_PSTAT_R                      ((uint32)(MC_PCU_BASEADDR+(uint32)0x0040UL))



/***************************************************************************/
/* User Defines */
#define STATUS_FLAG_READ                            ((uint32)0x1)
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined  
                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define STATUS_BITS_READ(type, value, shift)        ((type)(((type)value)<<shift))
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
                   /*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define PUT_VALUE_ON_REG(type, value, shift)        ((type)(((type)value)<<shift))

/******************************************************************************/
/*                                CLOCK OUT                                   */
/******************************************************************************/
/* Output Clock Division Select Register (CGM_OCDS_SC)*/
/* SELDIV field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CLOCK_OUT_DIV(x)                   ((uint32)(((uint32)x)<<28))
#define CLOCK_OUT_DIV_MASK                 ((uint32)(((uint32)0x3U)<<28))

#define CLOCK_OUT_NO_DIV                   0
#define CLOCK_OUT_2_DIV                    1
#define CLOCK_OUT_4_DIV                    2
#define CLOCK_OUT_8_DIV                    3

/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CLOCK_OUT_SOURCE(x)                ((uint32)(((uint32)x)<<24))

[!IF "(ecu:get('MCU.CGM_OUTPUT_CLK_RC_0') = 'true')"!][!//
#define CLOCK_OUT_SOURCE_RC                (0UL)

#define CLOCK_OUT_SOURCE_XOSC              (1UL)
[!ELSE!][!//
#define CLOCK_OUT_SOURCE_RC                (1UL)

#define CLOCK_OUT_SOURCE_XOSC              (0UL)

#define RUN_MODE_CONFIG                   ((uint32)0xFFFFFF90UL)
[!ENDIF!][!//

#define CLOCK_OUT_SOURCE_PLL0              (2UL)

#define CLOCK_OUT_SOURCE_PLL1              (3UL)

#define CLOCK_OUT_SOURCE_LPRC              (4UL)

#define CLOCK_OUT_SOURCE_LPXOSC            (5UL)

#define CLOCK_OUT_SOURCE_PLLPHI            (5UL)

#define CLOCK_OUT_SOURCE_RTCCLK            (4UL)

#define CLOCK_OUT_SOURCE_SYSCLK            (3UL)

#define CLOCK_OUT_SOURCE_MASK              ((uint32)(((uint32)0xFU)<<24))

/* Output Clock Enable Register (CGM_OC_EN) */
/* EN field */
#define CLOCK_OUT_ENABLE                   ((uint32)(((uint32)1)<<0))
#define CLOCK_OUT_DISABLE                  ((uint32)(((uint32)0)<<0))

#define CLOCK_OUT_MASK                     (CLOCK_OUT_SOURCE_MASK|CLOCK_OUT_DIV_MASK)

/******************************************************************************/
/*                  AUXILIARY CLOCK 0                                         */
/******************************************************************************/
/* Auxiliary Clock 0 Select Control Register (CGM_AC0_SC) */
/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_0(x)                       ((uint32)(((uint32)x)<<24))
#define AUX_CLK_0_RC                       0
#define AUX_CLK_0_XOSC                     2
#define AUX_CLK_0_PLL0                     4
#define AUX_CLK_0_PLL1_120                 5
#define AUX_CLK_0_PLL1_80                  8
#define AUX_CLK_0_MASK                     ((uint32)(((uint32)0xF)<<24))

/* Auxiliary Clock 0 Div Configuration Register (CGM_AC1_DC0) */
/* DIV0 field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_00_DIV(x)                  ((uint8)(((uint8)((uint8)x-(uint8)1))<<0))
/* Auxiliary Clock 0 Div Configuration Register (CGM_AC1_DC1) */
/* DIV0 field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_01_DIV(x)                  ((uint8)(((uint8)((uint8)x-(uint8)1))<<0))

/* DE0 field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_AUX_CLK_0                   ((uint8)(((uint8)1)<<7))
#define DISABLE_AUX_CLK_0                  ((uint8)(((uint8)0)<<7))

/* DE1 field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_AUX_CLK_01                  ((uint8)(((uint8)1)<<7))
#define DISABLE_AUX_CLK_01                 ((uint8)(((uint8)0)<<7))
/******************************************************************************/
/*                                                       AUXILIARY CLOCK 1                                                                                 */
/******************************************************************************/
/* Auxiliary Clock 1 Select Control Register (CGM_AC1_SC) */
/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_1(x)                       ((uint32)(((uint32)x)<<24))
#define AUX_CLK_1_PLL0                     4
#define AUX_CLK_1_PLL1_120                 5
#define AUX_CLK_1_PLL1_80                  8

#define AUX_CLK_1_MASK                     ((uint32)(((uint32)0xF)<<24))

/* Auxiliary Clock 1 Div Configuration Register (CGM_AC1_DC0) */
/* DIV0 field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_1_DIV(x)                   ((uint8)(((uint8)((uint8)x-(uint8)1))<<0))

/* DE0 field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_AUX_CLK_1                   ((uint8)(((uint8)1)<<7))
#define DISABLE_AUX_CLK_1                  ((uint8)(((uint8)0)<<7))
/******************************************************************************/
/*                                                       AUXILIARY CLOCK 2                                                                                 */
/******************************************************************************/
/* Auxiliary Clock 2 Select Control Register (CGM_AC2_SC) */
/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_2(x)                       ((uint32)(((uint32)x)<<24))
#define AUX_CLK_2_RC                       0
#define AUX_CLK_2_XOSC                     2
#define AUX_CLK_2_PLL0                     4
#define AUX_CLK_2_PLL1_120                 5
#define AUX_CLK_2_PLL1_80                  8
#define AUX_CLK_2_MASK                     ((uint32)(((uint32)0xF)<<24))
/* Auxiliary Clock 2 Div Configuration Register (CGM_AC2_DC0) */
/* DIV0 field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_2_DIV(x)                   ((uint8)(((uint8)((uint8)x-(uint8)1))<<0))

/* DE0 field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_AUX_CLK_2                   ((uint8)(((uint8)1)<<7))
#define DISABLE_AUX_CLK_2                  ((uint8)(((uint8)0)<<7))
/******************************************************************************/
/*                                                       AUXILIARY CLOCK 3                                                                                 */
/******************************************************************************/
/* Auxiliary Clock 3 Select Control Register (CGM_AC3_SC) */
/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_3(x)                       ((uint32)(((uint32)x)<<24))
[!IF "(ecu:get('MCU.Aux3Clock.Xtal.Value') = '2')"!][!//
#define AUX_CLK_3_XOSC                     2
[!ELSE!][!//
#define AUX_CLK_3_XOSC                     1
[!ENDIF!][!//
#define AUX_CLK_3_RC                       0
#define AUX_CLK_3_PLL0                     4
#define AUX_CLK_3_PLL0_D1                  8
#define AUX_CLK_3_PLL1_120                 5
#define AUX_CLK_3_PLL1_80                  8
#define AUX_CLK_3_MASK                     ((uint32)(((uint32)0xF)<<24))
/* Auxiliary Clock 3 Div Configuration Register (CGM_AC3_DC0) */
/* DIV0 field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_3_DIV(x)                   ((uint8)(((uint8)((uint8)x-(uint8)1))<<0))

/* DE0 field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_AUX_CLK_3                   ((uint8)(((uint8)1)<<7))
#define DISABLE_AUX_CLK_3                  ((uint8)(((uint8)0)<<7))
/******************************************************************************/
/*                                                       AUXILIARY CLOCK 4                                                                                 */
/******************************************************************************/
/* Auxiliary Clock 4 Select Control Register (CGM_AC4_SC) */
/* SELCTL field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define AUX_CLK_4(x)                       ((uint32)(((uint32)x)<<24))
#define AUX_CLK_4_XOSC                     1
#define AUX_CLK_4_RC                       0
#define AUX_CLK_4_MASK                     ((uint32)(((uint32)0xF)<<24))
/******************************************************************************/
/*                                                      RC OSCILLATOR                                                                                           */
/******************************************************************************/
/* RC Digital Interface Registers */
/* RCTRIM field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define RC_TRIM(x)                         ((uint32)(((uint32)x)<<16))
#define RC_TRIM_MASK                       ((uint32)(((uint32)0x3F)<<16))
#define RC_TRIM_MAX_VAL                    0x3FU


/******************************************************************************/
/*                                                      XOSCILLATOR                                                                                               */
/******************************************************************************/
/* Crystal Oscillator Control Register */
/* M_OSC field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_OSC_ISR                     ((uint32)(((uint32)1)<<15))
#define DISABLE_OSC_ISR                    ((uint32)(((uint32)0)<<15))

/* EOCV field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define EOCV_OSC_VALUE(x)                  ((uint32)(((uint32)x)<<16))

/* OSCBYP field */
#define OSC_BYP                            ((uint32)(((uint32)1)<<31))

#define OSC_BYP_ON                         (OSC_BYP)
#define OSC_BYP_OFF                        ((uint32)(((uint32)0)<<31))


/* I_OSC field */
#define OSC_CLOCK_ISR                      ((((uint32)0x1))<<7)

/* OSCON field */
  /*
    * @violates @ref Reg_eSys_MagicCarpet_h_REF_4 The names of standard library
    * macros, objects and functions shall not be reused.
    */
#define ENABLE_OSC                         ((uint32)(((uint32)1)<<0))
#define DISABLE_OSC                        ((uint32)(((uint32)0)<<0))

/* OSCDIV field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define OSC_DIV(x)                         ((uint32)(((uint32)(x - 1))<<8))
/******************************************************************************/
/*                                                      FMPLL CR                                                                                                        */
/******************************************************************************/
/* IDF field */
#define FMPLL_CR_IDF_1                     ((uint32)(((uint32)0)<<26))
#define FMPLL_CR_IDF_2                     ((uint32)(((uint32)1)<<26))
#define FMPLL_CR_IDF_3                     ((uint32)(((uint32)2)<<26))
#define FMPLL_CR_IDF_4                     ((uint32)(((uint32)3)<<26))
#define FMPLL_CR_IDF_5                     ((uint32)(((uint32)4)<<26))
#define FMPLL_CR_IDF_6                     ((uint32)(((uint32)5)<<26))
#define FMPLL_CR_IDF_7                     ((uint32)(((uint32)6)<<26))
#define FMPLL_CR_IDF_8                     ((uint32)(((uint32)7)<<26))
#define FMPLL_CR_IDF_9                     ((uint32)(((uint32)8)<<26))
#define FMPLL_CR_IDF_10                    ((uint32)(((uint32)9)<<26))
#define FMPLL_CR_IDF_11                    ((uint32)(((uint32)10)<<26))
#define FMPLL_CR_IDF_12                    ((uint32)(((uint32)11)<<26))
#define FMPLL_CR_IDF_13                    ((uint32)(((uint32)12)<<26))
#define FMPLL_CR_IDF_14                    ((uint32)(((uint32)13)<<26))
#define FMPLL_CR_IDF_15                    ((uint32)(((uint32)14)<<26))
#define FMPLL_CR_IDF_INHIBIT               ((uint32)(((uint32)15)<<26))

