DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
/* ODF field */
#define FMPLL_CR_ODF_2                     ((uint32)(((uint32)0)<<24))
#define FMPLL_CR_ODF_4                     ((uint32)(((uint32)1)<<24))
#define FMPLL_CR_ODF_8                     ((uint32)(((uint32)2)<<24))
#define FMPLL_CR_ODF_16                    ((uint32)(((uint32)3)<<24))

/* Ndiv field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define FMPLL_CR_NDIV(x)                   ((uint32)(((uint32)x)<<16))

/* en_pll_sw field */
#define FMPLL_ENABLE_SW                    ((uint32)(((uint32)1)<<8))
#define FMPLL_DISABLE_SW                   ((uint32)(((uint32)0)<<8))

/* unlock_once field */
#define FMPLL_UNLOCK_ONCE                  ((((uint32)0x1))<<6)

/* i_lock field */
#define FMPLL_ILOCK                        ((uint32)(((uint32)1)<<4))

/* s_lock field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
#define FMPLL_SLOCK                        ((((uint32)0x1))<<3)

/* pll_fail mask */
#define FMPLL_FAIL_ENABLE                  ((uint32)(((uint32)0)<<2))
#define FMPLL_FAIL_DISABLE                 ((uint32)(((uint32)1)<<2))

/*pll_fail flag */
#define PLL_CR_FAIL_FLAG                   ((uint32)(((uint32)1)<<1))

#define FMPLL0_CR_RESETVALUE               (0x05400001UL)

#define PLL1_CR_RESETVALUE                 (FMPLL0_CR_RESETVALUE)

/* Modes for PLL functionalities */
#define MCU_PLL0_NORMAL_MODE               0U
#define MCU_PLL0_FM_MODE                   1U
#define MCU_PLL0_UNUSED_MODE               2U

#define MCU_PLL1_NORMAL_MODE               0U
#define MCU_PLL1_UNUSED_MODE               2U
#define MCU_PLL1_FM_MODE                   1U
/******************************************************************************/
/*                                                      FMPLL MR                                                                                                       */
/******************************************************************************/
/* STR_BYPASS field */
#define FMPLL_STR_BYPASS_ON                ((uint32)(((uint32)1)<<31))
#define FMPLL_STR_BYPASS_OFF               ((uint32)(((uint32)0)<<31))

/* SFRD_SEL */
#define FMPLL_SPRDSEL_CENTER               ((uint32)(((uint32)0)<<29))
#define FMPLL_SPRDSEL_DOWN                 ((uint32)(((uint32)1)<<29))

/* Mod Period field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define FMPLL_MOD_PERIOD(x)                ((uint32)(((uint32)x)<<16))

/* FM Enable field */
#define FMPLL_FM_ENABLE                    ((uint32)(((uint32)1)<<15))
#define FMPLL_FM_DISABLE                   ((uint32)(((uint32)0)<<15))

/* INC_STEP field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define FMPLL_INC_STEP(x)                  ((uint32)(((uint32)x)<<0))

#define FMPLL0_MR_RESETVALUE               (0x0UL)

/******************************************************************************/
/*                                                      CMU_0_CSR                                                                                                    */
/******************************************************************************/
/* SFM field */
#define CMU0_MEASURE_START                 ((uint32)(((uint32)1)<<23))
#define CMU0_MEASURE_START_MASK            ((uint32)(((uint32)0xFFFFFUL)<<0))

/* RCDIV field*/
#define CMU0_RCDIV_1                       ((uint32)(((uint32)0)<<1))
#define CMU0_RCDIV_2                       ((uint32)(((uint32)1)<<1))
#define CMU0_RCDIV_4                       ((uint32)(((uint32)2)<<1))
#define CMU0_RCDIV_8                       ((uint32)(((uint32)3)<<1))

#define CMU0_RCDIV_MAX_VALUE               (CMU0_RCDIV_8)
#define CMU0_RCDIV_MASK                    ((uint32)(((uint32)0x3UL)<<1))
#define CMU0_CKSEL_MASK                    ((uint32)(((uint32)0x3UL)<<8))

/* CME field*/
#define CMU0_MONITOR_DISABLE               ((uint32)(((uint32)0)<<0))
#define CMU0_MONITOR_ENABLE                ((uint32)(((uint32)1)<<0))

#define CMU0_FMPLL_MONITOR_MASK            ((((uint32)0x1))<<0)

#define FMPLL0_CMU_RESETVALUE              (0x0UL)
/******************************************************************************/
/*                                                      CMU_0_HF                                                                                                     */
/******************************************************************************/
/* High Frequency register */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CMU0_HFREF(x)                      ((uint32)(((uint32)x)<<0))
#define CMU0_HFREF_MASK                    ((uint32)(((uint32)0xFFFUL)<<0))

/******************************************************************************/
/*                                                      CMU_0_LF                                                                                                     */
/******************************************************************************/
/* Low Frequency register */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CMU0_LFREF(x)                      ((uint32)(((uint32)x)<<0))
#define CMU0_LFREF_MASK                    ((uint32)(((uint32)0xFFFUL)<<0))

/******************************************************************************/
/*                                                      CMU_0_ISR                                                                                                     */
/******************************************************************************/
/* FLCI field */
#define CMU0_ISR_FLCI                      ((uint32)(((uint32)1)<<3))
/* FHHI field */
#define CMU0_ISR_FHHI                      ((uint32)(((uint32)1)<<2))
/* FLLI field */
#define CMU0_ISR_FLLI                      ((uint32)(((uint32)1)<<1))
/* OLRI field */
#define CMU0_ISR_OLRI                      ((uint32)(((uint32)1)<<0))

/******************************************************************************/
/*                                                      CMU_0_MDR                                                                                                 */
/******************************************************************************/
/* MDR field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CMU0_MDR(x)                        ((uint32)(((uint32)x)<<0))

/******************************************************************************/
/*                                                      CMU_0_FDR                                                                                                    */
/******************************************************************************/
/* FDR field */
#define CMU0_FDR                           ((uint32)(((uint32)0xFFFFF)<<0))

/******************************************************************************/
/*                                                      CMU_1_CSR                                                                                                    */
/******************************************************************************/
/* CME field */
#define CMU1_MONITOR_DISABLE               ((uint32)(((uint32)0)<<0))
#define CMU1_MONITOR_ENABLE                ((uint32)(((uint32)1)<<0))

