DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
/*******************************************************************************/
/*                                                      ME_ME                                                                                                              */
/*******************************************************************************/
/* Standby field */
#define ME_ME_STANDBY_ENABLE               ((uint32)(((uint32)1)<<13))
#define ME_ME_STANDBY_DISABLE              ((uint32)(((uint32)0)<<13))

/* Stop field */
#define ME_ME_STOP_ENABLE                  ((uint32)(((uint32)1)<<10))
#define ME_ME_STOP_DISABLE                 ((uint32)(((uint32)0)<<10))

/* Halt field */
#define ME_ME_HALT_ENABLE                  ((uint32)(((uint32)1)<<8))
#define ME_ME_HALT_DISABLE                 ((uint32)(((uint32)0)<<8))

/* RUN3 field */
#define ME_ME_RUN3_ENABLE                  ((uint32)(((uint32)1)<<7))
#define ME_ME_RUN3_DISABLE                 ((uint32)(((uint32)0)<<7))

/* RUN2 field */
#define ME_ME_RUN2_ENABLE                  ((uint32)(((uint32)1)<<6))
#define ME_ME_RUN2_DISABLE                 ((uint32)(((uint32)0)<<6))

/* RUN1 field */
#define ME_ME_RUN1_ENABLE                  ((uint32)(((uint32)1)<<5))
#define ME_ME_RUN1_DISABLE                 ((uint32)(((uint32)0)<<5))

/* Test field */
#define ME_ME_TEST_ENABLE                  ((uint32)(((uint32)1)<<1))
#define ME_ME_TEST_DISABLE                 ((uint32)(((uint32)0)<<1))

/*******************************************************************************/
/*                                                      ME_IS                                                                                                              */
/*******************************************************************************/
/* IMTC field */
#define ME_IS_MTC_SET                      ((uint32)(((uint32)1)<<0))
#define ME_IS_MTC_CLR                      ((((uint32)0x1))<<0)

/* ISAFE field */
#define ME_IS_SAFE_SET                     ((uint32)(((uint32)1)<<1))
#define ME_IS_SAFE_CLR                     ((((uint32)0x1))<<1)

/* IMODE field */
#define ME_IS_MODE_SET                     ((uint32)(((uint32)1)<<2))
#define ME_IS_MODE_CLR                     ((((uint32)0x1))<<2)

/* ICONF field */
#define ME_IS_CONF_SET                    ((uint32)(((uint32)1)<<3))
#define ME_IS_CONF_CLR                    ((((uint32)0x1))<<3)

/* ICONF (clock) field */
#define ME_IS_CLK_CONF_SET                ((uint32)(((uint32)1)<<4))
#define ME_IS_CLK_CONF_CLR                ((((uint32)0x1))<<4)

/*******************************************************************************/
/*                                                      ME_IM                                                                                                              */
/*******************************************************************************/
/* IMTC field */
#define ME_IE_MTC_ENABLE                  ((uint8)(((uint8)1)<<0))
#define ME_IE_MTC_DISABLE                 ((uint8)(((uint8)0)<<0))

/* ISAFE field */
#define ME_IE_SAFE_ENABLE                 ((uint8)(((uint8)1)<<1))
#define ME_IE_SAFE_DISABLE                ((uint8)(((uint8)0)<<1))

/* IMODE field */
#define ME_IE_MODE_ENABLE                 ((uint8)(((uint8)1)<<2))
#define ME_IE_MODE_DISABLE                ((uint8)(((uint8)0)<<2))

/* ICONF field */
#define ME_IE_CONF_ENABLE                 ((uint8)(((uint8)1)<<3))
#define ME_IE_CONF_DISABLE                ((uint8)(((uint8)0)<<3))

/* ICONF (clock) field */
#define ME_IE_CLK_CONF_ENABLE             ((uint8)(((uint8)1)<<4))
#define ME_IE_CLK_CONF_DISABLE            ((uint8)(((uint8)0)<<4))

/*******************************************************************************/
/*                                                      ME_IMTS                                                                                                           */
/*******************************************************************************/
/* SEA field */
#define ME_IMTS_SEA_SET                   ((uint32)(((uint32)1)<<0))
#define ME_IMTS_SEA_CLR                   ((((uint32)0x1))<<0)

/* NMA field */
#define ME_IMTS_NMA_SET                   ((uint32)(((uint32)1)<<1))
#define ME_IMTS_NMA_CLR                   ((((uint32)0x1))<<1)

/* DMA field */
#define ME_IMTS_DMA_SET                   ((uint32)(((uint32)1)<<2))
#define ME_IMTS_DMA_CLR                   ((((uint32)0x1))<<2)

/* MRI field */
#define ME_IMTS_MRI_SET                   ((uint32)(((uint32)1)<<3))
#define ME_IMTS_MRI_CLR                   ((((uint32)0x1))<<3)

/* MTI field */
#define ME_IMTS_MTI_SET                   ((uint32)(((uint32)1)<<4))
#define ME_IMTS_MTI_CLR                   ((((uint32)0x1))<<4)

/*******************************************************************************/
/*                                                      ME_<MODE>_MC                                                                                                */
/*******************************************************************************/
/* PDO flag*/
#define ME_MODE_POWER_DOWN_OUT            ((uint32)(((uint32)1)<<23))
#define ME_POWER_DOWN_OUT_ON              ((uint32)(((uint32)1)<<23))
#define ME_POWER_DOWN_OUT_OFF             ((uint32)(((uint32)0)<<23))
/* MVRON flag*/
#define ME_MODE_MAIN_VOLATAGE             ((uint32)(((uint32)1)<<20))
#define ME_MAIN_VOLATAGE_ON               ((uint32)(((uint32)1)<<20))
#define ME_MAIN_VOLATAGE_OFF              ((uint32)(((uint32)0)<<20))

/* DFLAON */
#define ME_MODE_DFAON_MASK                ((uint32)(((uint32)0x3)<<18))
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define ME_MODE_DFAON(x)                  ((uint32)(((uint32)x)<<18))

#define ME_DFLASH_POWERDOWN               (0x1UL)

#define ME_DFLASH_LOWPOWER                (0x2UL)

#define ME_DFLASH_NORMAL                  (0x3UL)
/* CFLAON */
#define ME_MODE_CFAON_MASK                ((uint32)(((uint32)0x3)<<16))
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define ME_MODE_CFAON(x)                  ((uint32)(((uint32)x)<<16))

#define ME_CFLASH_POWERDOWN               (0x1UL)

#define ME_CFLASH_LOWPOWER                (0x2UL)

#define ME_CFLASH_NORMAL                  (0x3UL)

/* PLL1ON */
#define ME_MODE_PLL1                      ((uint32)(((uint32)1)<<7))
#define ME_PLL1_ON                        ((uint32)(((uint32)1)<<7))
#define ME_PLL1_OFF                       ((uint32)(((uint32)0)<<7))

/* PLL0ON */
#define ME_MODE_PLL0                      ((uint32)(((uint32)1)<<6))
#define ME_PLL0_ON                        ((uint32)(((uint32)1)<<6))
#define ME_PLL0_OFF                       ((uint32)(((uint32)0)<<6))

