DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
/* XOSC */
#define ME_MODE_XOSC                      ((uint32)(((uint32)1)<<5))
#define ME_XOSC_ON                        ((uint32)(((uint32)1)<<5))
#define ME_XOSC_OFF                       ((uint32)(((uint32)0)<<5))

/* RC */
#define ME_MODE_RC                        ((uint32)(((uint32)1)<<4))
#define ME_RC_ON                          ((uint32)(((uint32)1)<<4))
#define ME_RC_OFF                         ((uint32)(((uint32)0)<<4))

/*SYSCLK */
#define ME_MODE_SYSCLK_MASK               ((uint32)(((uint32)0xF)<<0))
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define ME_MODE_SYSCLK(x)                 ((uint32)(((uint32)x)<<0))

#define ME_SYSCLK_SWITCH_DISABLED         (0xFUL)
#define ME_SYSCLK_SWITCH_RC               (0x0UL)
#define ME_SYSCLK_SWITCH_DIV_RC           (0x1UL)
#define ME_SYSCLK_SWITCH_XOSC             (0x2UL)
#define ME_SYSCLK_SWITCH_DIV_XOSC         (0x3UL)
#define ME_SYSCLK_SWITCH_PLL0             (0x4UL)
#define ME_SYSCLK_SWITCH_PLL1             (0x5UL)
#define ME_SYSCLK_SWITCH_CLK_DISABLED     (0x0UL)

#define ME_MODE_MASK                      (ME_MODE_POWER_DOWN_OUT|\
                                                        ME_MODE_MAIN_VOLATAGE|\
                                                        ME_MODE_DFAON_MASK|\
                                                        ME_MODE_CFAON_MASK|\
                                                        ME_MODE_PLL1|\
                                                        ME_MODE_PLL0|\
                                                        ME_MODE_XOSC|\
                                                        ME_MODE_RC|\
                                                        ME_MODE_SYSCLK_MASK)

#define ME_DRUN_MODE_RESET                ((uint32)(((uint32)0x001F0010)<<0))

/*******************************************************************************/
/*                                                      ME_RUN_PCx                                                                                                    */
/*******************************************************************************/
/* Run3 Field */
#define ME_RUN_RUN3_ACTIVE                ((uint32)(((uint32)1)<<7))
#define ME_RUN_RUN3_FROZEN                ((uint32)(((uint32)0)<<7))
/* Run2 Field */
#define ME_RUN_RUN2_ACTIVE                ((uint32)(((uint32)1)<<6))
#define ME_RUN_RUN2_FROZEN                ((uint32)(((uint32)0)<<6))
/* Run1 Field */
#define ME_RUN_RUN1_ACTIVE                ((uint32)(((uint32)1)<<5))
#define ME_RUN_RUN1_FROZEN                ((uint32)(((uint32)0)<<5))
/* Run0 Field */
#define ME_RUN_RUN0_ACTIVE                ((uint32)(((uint32)1)<<4))
#define ME_RUN_RUN0_FROZEN                ((uint32)(((uint32)0)<<4))
/* DRUN Field */
#define ME_RUN_DRUN_ACTIVE                ((uint32)(((uint32)1)<<3))
#define ME_RUN_DRUN_FROZEN                ((uint32)(((uint32)0)<<3))
/* SAFE Field */
#define ME_RUN_SAFE_ACTIVE                ((uint32)(((uint32)1)<<2))
#define ME_RUN_SAFE_FROZEN                ((uint32)(((uint32)0)<<2))
/* TEST Field */
#define ME_RUN_TEST_ACTIVE                ((uint32)(((uint32)1)<<1))
#define ME_RUN_TEST_FROZEN                ((uint32)(((uint32)0)<<1))

#define ME_RUN_PC0                        0x0U
#define ME_RUN_PC1                        0x1U
#define ME_RUN_PC2                        0x2U
#define ME_RUN_PC3                        0x3U
#define ME_RUN_PC4                        0x4U
#define ME_RUN_PC5                        0x5U
#define ME_RUN_PC6                        0x6U
#define ME_RUN_PC7                        0x7U
/*******************************************************************************/
/*                                                      ME_LP_PCx                                                                                                        */
/*******************************************************************************/
/* Standby Field */
#define ME_RUN_STBY_ACTIVE                ((uint32)(((uint32)1)<<13))
#define ME_RUN_STBY_FROZEN                ((uint32)(((uint32)0)<<13))
/* Stop Field */
#define ME_RUN_STOP_ACTIVE                ((uint32)(((uint32)1)<<10))
#define ME_RUN_STOP_FROZEN                ((uint32)(((uint32)0)<<10))
/* Halt Field */
#define ME_RUN_HALT_ACTIVE                ((uint32)(((uint32)1)<<8))
#define ME_RUN_HALT_FROZEN                ((uint32)(((uint32)0)<<8))

#define ME_LP_PC0                         0x0U
#define ME_LP_PC1                         0x1U
#define ME_LP_PC2                         0x2U
#define ME_LP_PC3                         0x3U
#define ME_LP_PC4                         0x4U
#define ME_LP_PC5                         0x5U
#define ME_LP_PC6                         0x6U
#define ME_LP_PC7                         0x7U

/*******************************************************************************/
/*                                                      ME_PCTLx                                                                                                        */
/*******************************************************************************/
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define ME_PCTLn(run,lp)                  (((uint8)(((uint8)lp)<<3)) | ((uint8)run))


/*******************************************************************************/
/*                                                     RGM_FES                                                                                                        */
/*******************************************************************************/

/* JTAG field */
#define RGM_FES_JTAG                      ((uint16)(((uint16)1)<<0))
/* CORE field */
#define RGM_FES_CORE                      ((uint16)(((uint16)1)<<1))
/* SOFT field */
#define RGM_FES_SOFT                      ((uint16)(((uint16)1)<<2))
/* CWD field */
#define RGM_FES_CWD                       ((uint16)(((uint16)1)<<3))
/* PLL0 field */
#define RGM_FES_PLL0                      ((uint16)(((uint16)1)<<4))
/* CMU0_OLR field */
#define RGM_FES_CMU0_OLR                  ((uint16)(((uint16)1)<<5))
/* CMU0_FHL field */
#define RGM_FES_CMU0_FHL                  ((uint16)(((uint16)1)<<6))
/* FCCU_SAFE field */
#define RGM_FES_FCCU_SAFE                 ((uint16)(((uint16)1)<<7))
/* SWT field */
#define RGM_FES_SWT                       ((uint16)(((uint16)1)<<8))
/* PLL1 filed*/
#define RGM_FES_PLL1                      ((uint16)(((uint16)1)<<9))
/* FL_ECC_RCC field  */
#define RGM_FES_FL_ECC_RCC                ((uint16)(((uint16)1)<<10))
/* CMU12_FHL field */
#define RGM_FES_CMU12_FHL                 ((uint16)(((uint16)1)<<11))
/* ST_DONE field */
#define RGM_FES_ST_DONE                   ((uint16)(((uint16)1)<<12))
/* FCCU_SOFT field */
#define RGM_FES_FCCU_SOFT                 ((uint16)(((uint16)1)<<13))
/* FCCU_HARD field */
#define RGM_FES_FCCU_HARD                 ((uint16)(((uint16)1)<<14))
/* EXR field */
#define RGM_FES_EXR                       ((uint16)(((uint16)1)<<15))

#define RGM_FES_MASK                      (RGM_FES_JTAG|\
                                                                    RGM_FES_CORE|\
                                                                    RGM_FES_SOFT|\
                                                                    RGM_FES_CWD|\
                                                                    RGM_FES_PLL0|\
                                                                    RGM_FES_CMU0_OLR|\
                                                                    RGM_FES_CMU0_FHL|\
                                                                    RGM_FES_FCCU_SAFE|\
                                                                    RGM_FES_SWT|\
                                                                    RGM_FES_PLL1|\
                                                                    RGM_FES_FL_ECC_RCC|\
                                                                    RGM_FES_CMU12_FHL|\
                                                                    RGM_FES_ST_DONE|\
                                                                    RGM_FES_FCCU_SOFT|\
                                                                    RGM_FES_FCCU_HARD|\
                                                                    RGM_FES_EXR)
/*******************************************************************************/
/*                                                     RGM_DES                                                                                                          */
/*******************************************************************************/
/* LVD12 field */
#define  RGM_DES_LVD12                    ((uint16)(((uint16)1)<<0))
/* HVD12 field */
#define  RGM_DES_HVD12                    ((uint16)(((uint16)1)<<1))
/* LVD27_VREG field */
#define  RGM_DES_LVD27_VREG               ((uint16)(((uint16)1)<<2))
/* LVD27_FLASH field */
#define  RGM_DES_LVD27_FLASH              ((uint16)(((uint16)1)<<3))
/* LVD27_IO field */
#define  RGM_DES_LVD27_IO                 ((uint16)(((uint16)1)<<4))
/* COMP field */
#define  RGM_DES_COMP                     ((uint16)(((uint16)1)<<5))
/* POR field */
#define RGM_DES_POR                       ((uint16)(((uint16)1)<<15))
/* SOFT_DEST field */
#define RGM_DES_SOFT_DEST                 ((uint16)(((uint16)1)<<14))

#define RGM_DES_MASK                      (RGM_DES_LVD12|\
                                                                RGM_DES_HVD12|\
                                                                RGM_DES_LVD27_VREG|\
                                                                RGM_DES_LVD27_FLASH|\
                                                                RGM_DES_LVD27_IO|\
                                                                RGM_DES_COMP|\
                                                                RGM_DES_POR)

