DriveMani/DriverInput-MCU/ts_mirr/xml/eb-tresos-MPC560XB_MCAL4_0_RTM_1_0_1_HF13/plugins/Mcu_TS_T2D13M10I1R0/generate_PC/include/Reg_eSys_MagicCarpet.h
/*******************************************************************************/
/*                                                     RGM_DEAR                                                                                                          */
/*******************************************************************************/
/* LVD12_PD0 field */
#define  DEAR_LVD12_PD0_ISR               ((uint16)(((uint16)1)<<0))
#define  DEAR_LVD12_PD0_SAFE              ((uint16)(((uint16)0)<<0))
/* LVD12_PD1 field */
#define  DEAR_LVD12_PD1_ISR               ((uint16)(((uint16)1)<<1))
#define  DEAR_LVD12_PD1_SAFE              ((uint16)(((uint16)0)<<1))
/* SWT field */
#define DEAR_SWT_ISR                      ((uint16)(((uint16)1)<<2))
#define DEAR_SWT_SAFE                     ((uint16)(((uint16)0)<<2))
/* LVD27 field */
#define DEAR_LVD27_ISR                    ((uint16)(((uint16)1)<<3))
#define DEAR_LVD27_SAFE                   ((uint16)(((uint16)0)<<3))

#define MCU_RGM_DES_REG_MASK              ((uint16)0xFFFFU)
#define MCU_RGM_FES_REG_MASK              ((uint16)0xFFFFU)
#define MCU_MASK_EXT_RESET                ((uint32)0x80000000UL)
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_ST_NCF_RESET')"!][!//
#define MCU_MASK_ST_NCF_RESET             ((uint32)0x40000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_FCCU_HARD_RESET')"!][!//
#define MCU_MASK_FCCU_HARD_RESET          ((uint32)0x40000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_FCCU_SOFT_RESET')"!][!//
#define MCU_MASK_FCCU_SOFT_RESET          ((uint32)0x20000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_ST_CF_RESET')"!][!//
#define MCU_MASK_ST_CF_RESET              ((uint32)0x20000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_ST_DONE_RESET')"!][!//
#define MCU_MASK_ST_DONE_RESET            ((uint32)0x10000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CMU12_FHL_RESET')"!][!//
#define MCU_MASK_CMU12_FHL_RESET          ((uint32)0x08000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_FL_ECC_RCC_RESET')"!][!//
#define MCU_MASK_FL_ECC_RCC_RESET         ((uint32)0x04000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_Z4CORE_RESET')"!][!//
#define MCU_MASK_Z4CORE_RESET             ((uint32)0x04000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_PLL1_RESET')"!][!//
#define MCU_MASK_PLL1_RESET               ((uint32)0x02000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_WATCHDOG_RESET')"!][!//
#define MCU_MASK_SWT_F_RESET                ((uint32)0x01000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_FLASH_RESET')"!][!//
#define MCU_MASK_FLASH_RESET              ((uint32)0x01000000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_FCCU_SAFE_RESET')"!][!//
#define MCU_MASK_FCCU_SAFE_RESET          ((uint32)0x00800000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_4_5_LOW_VOLTAGE')"!][!//
#define MCU_MASK_LVD45_RESET              ((uint32)0x00800000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CMU_FHL_RESET')"!][!//
#define MCU_MASK_CMU0_FHL_RESET           ((uint32)0x00400000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CMU_OLR_RESET')"!][!//
#define MCU_MASK_CMU0_OLR_RESET           ((uint32)0x00200000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_PLL0_RESET')"!][!//
#define MCU_MASK_PLL0_RESET               ((uint32)0x00100000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CWD_RESET')"!][!//
#define MCU_MASK_CWD_RESET                ((uint32)0x00080000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CHECKSTOP_RESET')"!][!//
#define MCU_MASK_CHECKSTOP_RESET          ((uint32)0x00080000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_SW_RESET')"!][!//
#define MCU_MASK_SOFT_RESET               ((uint32)0x00040000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_SOFT_FUNC_RESET')"!][!//
#define MCU_MASK_SOFT_FUNC_RESET         ((uint32)0x00040000UL)  /* Flag for software (functional) reset */
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_CORE_RESET')"!][!//
#define MCU_MASK_CORE_RESET               ((uint32)0x00020000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_JTAG_RESET')"!][!//
#define MCU_MASK_JTAG_RESET               ((uint32)0x00010000UL)
[!ENDIF!][!//
#define MCU_MASK_POR_RESET                ((uint32)0x00008000UL)
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_SOFT_DEST_RESET')"!][!//
#define MCU_MASK_SOFT_DEST_RESET          ((uint32)0x00004000UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_2_7_LV_ADC_RESET')"!][!//
#define MCU_MASK_LVD27_ADC_RESET          ((uint32)0x00000080UL)  /* Flag for 2.7 V low-voltage det. (ADC supply) */
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_2_7_LV_IO_RESET')"!][!//
#define MCU_MASK_LVD27_IO_RESET           ((uint32)0x00000040UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_2_7_LV_FLASH_RESET')"!][!//
#define MCU_MASK_LVD27_FLASH_RESET        ((uint32)0x00000020UL)  /* Flag for 2.7 V low-voltage det. (flash) */
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_2_7_LV_VREG_RESET')"!][!//
#define MCU_MASK_LVD27_VREG_RESET         ((uint32)0x00000010UL)  /* Flag for 2.7 V low-voltage det. (VREG) */
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_2_7_LOW_VOLTAGE')"!][!//
#define MCU_MASK_LVD27_RESET              ((uint32)0x00000008UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_SWT_D_RESET')"!][!//
#define MCU_MASK_SWT_D_RESET              ((uint32)0x00000004UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_SWT1_D_RESET')"!][!//
#define MCU_MASK_SWT1_D_RESET             ((uint32)0x00000008UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_1_2_LV_PW_DOMAIN_1')"!][!//
#define MCU_MASK_LVD12_PD1_RESET          ((uint32)0x00000002UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_1_2_HV_RESET')"!][!//
#define MCU_MASK_HVD12_RESET              ((uint32)0x00000002UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_1_2_LV_PW_DOMAIN_0')"!][!//
#define MCU_MASK_LVD12_PD0_RESET          ((uint32)0x00000001UL)
[!ENDIF!][!//
[!IF "contains(ecu:get('Mcu.ResetReason.List'),'MCU_1_2_LV_RESET')"!][!//
#define MCU_MASK_LVD12_RESET              ((uint32)0x00000001UL)
[!ENDIF!][!//
#define MCU_MASK_COMP_RESET               ((uint32)0x00000080UL)


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/


/*==================================================================================================
                                             ENUMS
==================================================================================================*/


/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MAGICCARPET_H */

/** @} */
